renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
#include <stdio.h>
#include <string.h>

#include "FreeRTOS.h"
#include "FreeRTOSIPConfig.h"
#include "platform.h"
#include "r_sci_rx_if.h"
#include "r_sci_rx_config.h"
#include "r_sci_rx_pinset.h"
#include "r_byteq_if.h"
#include "sx_ulpgn_driver.h"

#if !defined(MY_BSP_CFG_UART_WIFI_SCI)
#error "Error! Need to define MY_BSP_CFG_UART_WIFI_SCI in r_bsp_config.h"
#elif MY_BSP_CFG_UART_WIFI_SCI == (0)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI0()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH0
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH0_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH0_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (1)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI1()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH1
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH1_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH1_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (2)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI2()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH2
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH2_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH2_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (3)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI3()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH3
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH3_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH3_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (4)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI4()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH4
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH4_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH4_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (5)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI5()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH5
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH5_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH5_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (6)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI6()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH6
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH6_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH6_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (7)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI7()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH7
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH7_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH7_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (8)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI8()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH8
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH8_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH8_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (9)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI9()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH9
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH9_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH9_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (10)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI10()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH10
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH10_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH10_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (11)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI11()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH11
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH11_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH11_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SCI == (12)
#define R_SCI_PinSet_sx_ulpgn_serial_default()  R_SCI_PinSet_SCI12()
#define SCI_CH_sx_ulpgn_serial_default          SCI_CH12
#define SCI_TX_BUSIZ_DEFAULT                    SCI_CFG_CH12_TX_BUFSIZ
#define SCI_RX_BUSIZ_DEFAULT                    SCI_CFG_CH12_RX_BUFSIZ
#else
#error "Error! Invalid setting for MY_BSP_CFG_UART_WIFI_SCI in r_bsp_config.h"
#endif

#if !defined(MY_BSP_CFG_UART_WIFI_SECOND_SCI)
#error "Error! Need to define MY_BSP_CFG_UART_WIFI_SECOND_SCI in r_bsp_config.h"
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (0)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI0()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH0
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH0_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH0_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (1)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI1()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH1
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH1_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH1_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (2)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI2()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH2
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH2_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH2_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (3)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI3()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH3
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH3_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH3_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (4)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI4()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH4
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH4_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH4_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (5)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI5()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH5
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH5_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH5_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (6)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI6()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH6
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH6_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH6_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (7)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI7()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH7
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH7_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH7_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (8)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI8()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH8
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH8_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH8_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (9)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI9()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH9
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH9_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH9_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (10)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI10()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH10
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH10_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH10_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (11)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI11()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH11
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH11_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH11_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (12)
#define R_SCI_PinSet_sx_ulpgn_serial_second()  R_SCI_PinSet_SCI12()
#define SCI_CH_sx_ulpgn_serial_second          SCI_CH12
#define SCI_TX_BUSIZ_SECOND                    SCI_CFG_CH12_TX_BUFSIZ
#define SCI_RX_BUSIZ_SECOND                    SCI_CFG_CH12_RX_BUFSIZ
#elif MY_BSP_CFG_UART_WIFI_SECOND_SCI == (-1)
#define R_SCI_PinSet_sx_ulpgn_serial_second()
#define SCI_CH_sx_ulpgn_serial_second
#define SCI_TX_BUSIZ_SECOND
#define SCI_RX_BUSIZ_SECOND
#else
#error "Error! Invalid setting for MY_BSP_CFG_UART_WIFI_SECOND_SCI in r_bsp_config.h"
#endif

