renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
#define ULPGN_UART_DEFAULT_PORT (0)
#define ULPGN_UART_SECOND_PORT (1)

#define MUTEX_TX (1 << 0)
#define MUTEX_RX (1 << 1)

uint8_t ULPGN_USE_UART_NUM = 2;

uint32_t g_sx_ulpgn_tx_busiz_command;
uint32_t g_sx_ulpgn_tx_busiz_data;
uint32_t g_sx_ulpgn_rx_busiz_command;
uint32_t g_sx_ulpgn_rx_busiz_data;

uint8_t g_sx_ulpgn_cleateble_sockets;
uint8_t ULPGN_UART_COMMAND_PORT;
uint8_t ULPGN_UART_DATA_PORT;

const uint8_t ulpgn_return_text_ok[]          = ULPGN_RETURN_TEXT_OK;
const uint8_t ulpgn_return_text_connect[]     = ULPGN_RETURN_TEXT_CONNECT;
const uint8_t ulpgn_return_text_ring[]        = ULPGN_RETURN_TEXT_RING;
const uint8_t ulpgn_return_text_no_carrier[]  = ULPGN_RETURN_TEXT_NO_CARRIER;
const uint8_t ulpgn_return_text_error[]       = ULPGN_RETURN_TEXT_ERROR;
const uint8_t ulpgn_return_text_no_dialtone[] = ULPGN_RETURN_TEXT_NO_DIALTONE;
const uint8_t ulpgn_return_text_busy[]        = ULPGN_RETURN_TEXT_BUSY;
const uint8_t ulpgn_return_text_no_answer[]   = ULPGN_RETURN_TEXT_NO_ANSWER;

const uint8_t ulpgn_return_numeric_ok[]          = ULPGN_RETURN_NUMERIC_OK;
const uint8_t ulpgn_return_numeric_connect[]     = ULPGN_RETURN_NUMERIC_CONNECT;
const uint8_t ulpgn_return_numeric_ring[]        = ULPGN_RETURN_NUMERIC_RING;
const uint8_t ulpgn_return_numeric_no_carrier[]  = ULPGN_RETURN_NUMERIC_NO_CARRIER;
const uint8_t ulpgn_return_numeric_error[]       = ULPGN_RETURN_NUMERIC_ERROR;
const uint8_t ulpgn_return_numeric_no_dialtone[] = ULPGN_RETURN_NUMERIC_NO_DIALTONE;
const uint8_t ulpgn_return_numeric_busy[]        = ULPGN_RETURN_NUMERIC_BUSY;
const uint8_t ulpgn_return_numeric_no_answer[]   = ULPGN_RETURN_NUMERIC_NO_ANSWER;

const uint8_t ulpgn_socket_status_closed[]       = ULPGN_SOCKET_STATUS_TEXT_CLOSED;
const uint8_t ulpgn_socket_status_socket[]       = ULPGN_SOCKET_STATUS_TEXT_SOCKET;
const uint8_t ulpgn_socket_status_bound[]        = ULPGN_SOCKET_STATUS_TEXT_BOUND;
const uint8_t ulpgn_socket_status_listen[]       = ULPGN_SOCKET_STATUS_TEXT_LISTEN;
const uint8_t ulpgn_socket_status_connected[]    = ULPGN_SOCKET_STATUS_TEXT_CONNECTED;

const uint8_t ulpgn_return_dummy[]   = "";

const uint32_t g_sx_ulpgn_serial_buffsize_table[2][4] =
{
    /*SCI_TX_BUSIZ_DEFAULT*//*SCI_TX_BUSIZ_SIZE*/   /*SCI_RX_BUSIZ_DEFAULT*/ /*SCI_RX_BUSIZ_SIZE*/
    {SCI_TX_BUSIZ_DEFAULT,  SCI_TX_BUSIZ_DEFAULT,  SCI_RX_BUSIZ_DEFAULT,  SCI_RX_BUSIZ_DEFAULT,  }, /*ULPGN_USE_UART_NUM = 1 */
    {SCI_TX_BUSIZ_SECOND,   SCI_TX_BUSIZ_DEFAULT,  SCI_TX_BUSIZ_SECOND,   SCI_RX_BUSIZ_DEFAULT,  }, /*ULPGN_USE_UART_NUM = 2 */
};

const uint8_t * const ulpgn_result_code[ULPGN_RETURN_ENUM_MAX][ULPGN_RETURN_STRING_MAX] =
{
    /* text mode*/                  /* numeric mode */
    {ulpgn_return_text_ok,          ulpgn_return_numeric_ok          },
    {ulpgn_return_text_connect,     ulpgn_return_numeric_connect     },
    {ulpgn_return_text_ring,        ulpgn_return_numeric_ring        },
    {ulpgn_return_text_no_carrier,  ulpgn_return_numeric_no_carrier  },
    {ulpgn_return_text_error,       ulpgn_return_numeric_error       },
    {ulpgn_return_dummy,            ulpgn_return_dummy               },
    {ulpgn_return_text_no_dialtone, ulpgn_return_numeric_no_dialtone },
    {ulpgn_return_text_busy,        ulpgn_return_numeric_busy        },
    {ulpgn_return_text_no_answer,   ulpgn_return_numeric_no_answer   },
};

const uint8_t * const ulpgn_socket_status[ULPGN_SOCKET_STATUS_MAX] =
{
    ulpgn_socket_status_closed,
    ulpgn_socket_status_socket,
    ulpgn_socket_status_bound,
    ulpgn_socket_status_listen,
    ulpgn_socket_status_connected,
};

volatile uint8_t current_socket_index;
uint8_t buff[1000];
uint8_t recvbuff[1500];
sci_cfg_t   g_sx_ulpgn_sci_config[2];
volatile uint32_t g_sx_ulpgn_uart_teiflag[2];
static uint8_t timeout_overflow_flag[2];
static sci_hdl_t sx_ulpgn_uart_sci_handle[2];
static TickType_t starttime[2], thistime[2], endtime[2];
static TickType_t startbytetime[2], thisbytetime[2], endbytetime[2];
static uint8_t byte_timeout_overflow_flag[2];

uint8_t g_sx_ulpgn_return_mode;

static void sx_ulpgn_uart_callback_second_port_for_command(void *pArgs);
static void sx_ulpgn_uart_callback_default_port_for_inititial(void *pArgs);
static void sx_ulpgn_uart_callback_default_port_for_data(void *pArgs);
static void timeout_init(uint8_t serial_ch, uint32_t timeout_ms);
static void bytetimeout_init(uint8_t serial_ch, uint32_t timeout_ms);
static int32_t check_timeout(uint8_t serial_ch, int32_t rcvcount);
static int32_t check_bytetimeout(uint8_t serial_ch, int32_t rcvcount);
static void tcp_timeout_init(uint8_t socket_no, uint32_t timeout_ms, uint8_t flag);
static int32_t tcp_check_timeout(uint8_t socket_no, uint8_t flag);

static int32_t sx_ulpgn_serial_open_for_initial(void);
static int32_t sx_ulpgn_serial_open_for_data(void);
static int32_t sx_ulpgn_serial_close(void);
static int32_t sx_ulpgn_serial_escape(void);
static int32_t sx_ulpgn_serial_second_port_open(void);
static int32_t sx_ulpgn_serial_second_port_close(void);
static int32_t sx_ulpgn_serial_send_basic(uint8_t serial_ch_id, const char *ptextstring, uint16_t response_type, uint16_t timeout_ms, sx_ulpgn_return_code_t expect_code);
static int32_t sx_ulpgn_check_uart_state(uint16_t response_type, uint16_t timeout_ms,uint32_t *uart_receive_status, uint32_t *uart_send_status);

static int32_t sx_ulpgn_serial_send_basic_take_mutex(uint8_t mutex_flag);
static void sx_ulpgn_serial_send_basic_give_mutex(uint8_t mutex_flag);
static int32_t sx_ulpgn_get_socket_status(uint8_t socket_no);
static int32_t sx_ulpgn_change_socket_index(uint8_t socket_no);
static TickType_t g_sl_ulpgn_tcp_recv_timeout = 0;       /* ## slowly problem ## unit: 1ms */

/**
 * @brief The global mutex to ensure that only one operation is accessing the
 * g_sx_ulpgn_tx_semaphore flag at one time.
 */
static SemaphoreHandle_t g_sx_ulpgn_tx_semaphore = NULL;
static SemaphoreHandle_t g_sx_ulpgn_rx_semaphore = NULL;

/**
 * @brief Maximum time in ticks to wait for obtaining a semaphore.
 */
static const TickType_t xMaxSemaphoreBlockTime = pdMS_TO_TICKS( 10000UL );

typedef struct
{
    byteq_hdl_t socket_byteq_hdl;
    uint8_t socket_recv_buff[16384];
    uint8_t socket_status;
    uint8_t socket_recv_error_count;
    uint8_t socket_create_flag;
    uint8_t socket_not_create_recv_count;
    TickType_t send_starttime;
    TickType_t send_thistime;
    TickType_t send_endtime;
    TickType_t recv_starttime;
    TickType_t recv_thistime;
    TickType_t recv_endtime;
    uint8_t send_timeout_overflow_flag;
    uint8_t recv_timeout_overflow_flag;
} ulpgn_socket_t;

ulpgn_socket_t g_ulpgn_socket[CREATEABLE_SOCKETS];

static uint8_t g_temporary_byteq_enable_flag = 0;
static uint8_t g_sockindex_command_flag = 0;
typedef struct
{
    uint32_t queue_overflow_count;
    uint32_t eri_overflow_count;
    uint32_t eri_framing_count;
    uint32_t eri_parity_count;
} uart_error_count_t;

uart_error_count_t uart_error_count[2];

uint8_t g_sx_ulpgn_ipaddress[4];
uint8_t g_sx_ulpgn_subnetmask[4];
uint8_t g_sx_ulpgn_gateway[4];

