renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
uint32_t test_recvdat = 0xa5;
uint32_t test_senddat = 0x5a;

int32_t sx_ulpgn_wifi_init(void)
{
    int32_t ret;
    sci_baud_t change_boud;
#if ULPGN_PORT_DEBUG == 1
    DEBUG_PORT4_DDR = 1;
    DEBUG_PORT4_DR = 0;
    DEBUG_PORT7_DDR = 1;
    DEBUG_PORT7_DR = 0;
#endif

    ULPGN_USE_UART_NUM = 2;
    g_sx_ulpgn_cleateble_sockets = CREATEABLE_SOCKETS;
    ULPGN_UART_COMMAND_PORT = ULPGN_UART_DEFAULT_PORT;
//  ULPGN_UART_DATA_PORT = 1;
    g_sx_ulpgn_tx_busiz_command = g_sx_ulpgn_serial_buffsize_table[1][0];
    g_sx_ulpgn_tx_busiz_data    = g_sx_ulpgn_serial_buffsize_table[1][1];
    g_sx_ulpgn_rx_busiz_command = g_sx_ulpgn_serial_buffsize_table[1][2];
    g_sx_ulpgn_rx_busiz_data    = g_sx_ulpgn_serial_buffsize_table[1][3];

    /* Wifi Module hardware reset   */
    ULPGN_RESET_PORT_PDR = 1;
    ULPGN_RESET_PORT_PODR = 0; /* Low */
    R_BSP_SoftwareDelay(26, BSP_DELAY_MILLISECS); /* 5us mergin 1us */
    ULPGN_RESET_PORT_PODR = 1; /* High */
    R_BSP_SoftwareDelay(200, BSP_DELAY_MILLISECS); /*  */

    for (uint8_t i = 0; i < CREATEABLE_SOCKETS; i++)
    {
        g_ulpgn_socket[i].socket_create_flag = 0;
    }

    if (g_sx_ulpgn_tx_semaphore != NULL)
    {
        vSemaphoreDelete(g_sx_ulpgn_tx_semaphore);
    }

    g_sx_ulpgn_tx_semaphore = xSemaphoreCreateMutex();

    if( g_sx_ulpgn_tx_semaphore == NULL )
    {
        return -1;
    }

    if (g_sx_ulpgn_rx_semaphore != NULL)
    {
        vSemaphoreDelete(g_sx_ulpgn_rx_semaphore);
    }

    g_sx_ulpgn_rx_semaphore = xSemaphoreCreateMutex();

    if( g_sx_ulpgn_rx_semaphore == NULL )
    {
        return -1;
    }

    ret = sx_ulpgn_serial_open_for_initial();
    if(ret != 0)
    {
        return ret;
    }



    g_sx_ulpgn_return_mode = 0;

    /* no echo */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATE0\r", 5, 400, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }
    g_sx_ulpgn_return_mode = 1;
    /* result code format = numeric */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATV0\r", 3, 200, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }

    /* Check HSUART2 connection */
    /* Command Port = HSUART2 */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATUART=2\r", 3, 2000, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }

    R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 1 sec */

    ULPGN_UART_COMMAND_PORT = ULPGN_UART_SECOND_PORT;

    ret = sx_ulpgn_serial_second_port_open();
    if(ret != 0)
    {
        return ret;
    }

    sx_ulpgn_serial_close();

    /* Command Port = HSUART2, Data Port = HSUART1 */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATV0\r", 100, 2000, ULPGN_RETURN_OK);
    if(ret == 0)
    {
        /* HSUART2 and SCI are connecting.
         *  -> multiple UART control. */
#if DEBUGLOG == 1
        printf("=-=-= Multiple connection!=-=-=\r\n");
#endif
        ret = sx_ulpgn_serial_open_for_data();
        if(ret != 0)
        {
            return ret;
        }
        /* Change HSUART1 baudrate and flow control. */
        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATBX1=230400,,,,h\r", 3, 200, ULPGN_RETURN_OK);
        if(ret != 0)
        {
            return ret;
        }
        R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], SCI_CMD_EN_CTS_IN, NULL);
        ULPGN_HSUART1_RTS_PODR = 0;
        ULPGN_HSUART1_RTS_PDR = 1;
        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 5us mergin 1us */

        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATUART=2,1\r", 3, 2000, ULPGN_RETURN_OK);
        if(ret != 0)
        {
            return ret;
        }
        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 1 sec */

        ULPGN_USE_UART_NUM = 2;
        g_sx_ulpgn_cleateble_sockets = 4;
        ULPGN_UART_COMMAND_PORT = ULPGN_UART_SECOND_PORT;
        ULPGN_UART_DATA_PORT = ULPGN_UART_DEFAULT_PORT;
        g_sx_ulpgn_tx_busiz_command = g_sx_ulpgn_serial_buffsize_table[1][0];
        g_sx_ulpgn_tx_busiz_data    = g_sx_ulpgn_serial_buffsize_table[1][1];
        g_sx_ulpgn_rx_busiz_command = g_sx_ulpgn_serial_buffsize_table[1][2];
        g_sx_ulpgn_rx_busiz_data    = g_sx_ulpgn_serial_buffsize_table[1][3];

    }
    else
    {
        /* HSUART2 and SCI are not connecting.
         * -> single UART */

#if DEBUGLOG == 1
        printf("=-=-= Single connection!=-=-=\r\n");
#endif
        ret = sx_ulpgn_serial_second_port_close();

        ULPGN_USE_UART_NUM = 1;
        g_sx_ulpgn_cleateble_sockets = 1;
        ULPGN_UART_COMMAND_PORT = ULPGN_UART_DEFAULT_PORT;
        ULPGN_UART_DATA_PORT = ULPGN_UART_DEFAULT_PORT;
        g_sx_ulpgn_tx_busiz_command = g_sx_ulpgn_serial_buffsize_table[0][0];
        g_sx_ulpgn_tx_busiz_data    = g_sx_ulpgn_serial_buffsize_table[0][1];
        g_sx_ulpgn_rx_busiz_command = g_sx_ulpgn_serial_buffsize_table[0][2];
        g_sx_ulpgn_rx_busiz_data    = g_sx_ulpgn_serial_buffsize_table[0][3];

        /* Wifi Module hardware reset   */
        ULPGN_RESET_PORT_PDR = 1;
        ULPGN_RESET_PORT_PODR = 0; /* Low */
        R_BSP_SoftwareDelay(26, BSP_DELAY_MILLISECS); /* 5us mergin 1us */
        ULPGN_RESET_PORT_PODR = 1; /* High */
        R_BSP_SoftwareDelay(200, BSP_DELAY_MILLISECS); /*  */

        g_sx_ulpgn_return_mode = 0;

        ret = sx_ulpgn_serial_open_for_initial();
        if(ret != 0)
        {
            return ret;
        }


        /* no echo */
        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATE0\r", 3, 200, ULPGN_RETURN_OK);
        if(ret != 0)
        {
            return ret;
        }
        g_sx_ulpgn_return_mode = 1;
        /* result code format = numeric */
        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATV0\r", 3, 200, ULPGN_RETURN_OK);
        if(ret != 0)
        {
            return ret;
        }

        /* Change HSUART1 baudrate and flow control. */
        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATBX1=115200,,,,h\r", 3, 200, ULPGN_RETURN_OK);
        if(ret != 0)
        {
            return ret;
        }
        change_boud.pclk = BSP_PCLKB_HZ;
        change_boud.rate = 115200;
        R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], SCI_CMD_CHANGE_BAUD, &change_boud);
        R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], SCI_CMD_EN_CTS_IN, NULL);
        ULPGN_HSUART1_RTS_PODR = 0;
        ULPGN_HSUART1_RTS_PDR = 1;
        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 5us mergin 1us */

