renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
    }

    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATS108?\r", 3, 200, ULPGN_RETURN_OK);

    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATS108=1\r", 3, 200, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }

//  1875000 921600
    /* Escape guard time = 200msec */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATS12=1\r", 1000 , 200, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }

    /* Buffer size = 1420byte */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATBSIZE=1420\r", 1000 , 200, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }

    /* Disconnect from currently connected Access Point, */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATWD\r", 3, 200, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }
    current_socket_index = 0;

    /* Enable DHCP */
    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATNDHCP=1\r", 3, 200, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }

    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATTO=1\r", 3, 1000, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return ret;
    }

    ret = sx_ulpgn_check_uart_state(100, 400, &test_recvdat, &test_senddat);
    if(ret != 0)
    {
        R_BSP_NOP();
    }
    R_BSP_NOP();

    ret = sx_ulpgn_check_uart_state(100, 400, &test_recvdat, &test_senddat);
    if(ret != 0)
    {
    	R_BSP_NOP();
    }
    R_BSP_NOP();


    if(0)
    {
        /* Command Port = HSUART1(PMOD-UART), Data Port = Debug　UART */
        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATUART=1,2\r", 3, 2000, ULPGN_RETURN_OK);
        if(ret != 0)
        {
            return ret;
        }

        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_DATA_PORT, NULL, 1000, 200, ULPGN_RETURN_OK);
    }
//    ret = sx_ulpgn_socket_init();

    return ret;
}


int32_t sx_ulpgn_wifi_connect(const char *pssid, uint32_t security, const char *ppass)
{
    int32_t ret;
    char *pstr, pstr2;
    int32_t line_len;
    int32_t scanf_ret;
    volatile char secu[3][10];
    uint32_t security_encrypt_type = 1;
    uint8_t mutex_flag;
    uint8_t retry_count;

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

    if(0 ==  is_sx_ulpgn_wifi_connect())
    {
    	/* If Wifi is already connected, do nothing and return fail. */
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    	if(0 != sx_ulpgn_wifi_disconnect())
    	{
    		return -1;
    	}
        if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
    	{
        	return -1;
    	}
    }


    R_BSP_SoftwareDelay(2000, BSP_DELAY_MILLISECS);
//    vTaskDelay(2000); // timing issue

    strcpy((char *)buff, "ATWAWPA=");
    strcat((char *)buff, (const char *)pssid);
    strcat((char *)buff, ",");
    if(security != ULPGN_SECURITY_WPA && security != ULPGN_SECURITY_WPA2)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }
    if(security == ULPGN_SECURITY_WPA)
    {
        strcat((char *)buff, "1,");
    }
    else
    {
        strcat((char *)buff, "2,");
    }
    if(security_encrypt_type == 1)
    {
        strcat((char *)buff, "1,1,");
    }
    else
    {
        strcat((char *)buff, "0,0,");
    }
    strcat((char *)buff, (const char *)ppass);
    strcat((char *)buff, "\r");

    for(retry_count = 0;retry_count < 3;retry_count++)
    {
		ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, buff, 3, 20000, ULPGN_RETURN_OK);
		if((0 == ret) || (-2 == ret))
		{
			if(-2 == ret)
			{
				ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATW\r", 3, 1000, ULPGN_RETURN_OK);
				if(0 == ret)
				{
					ret = -1;
					pstr = strstr(recvbuff,"ssid         =   ");
					if(pstr != NULL)
					{
						pstr2 = recvbuff + strlen("ssid         =   ");
						pstr = strstr(pstr2,"\r\n");
						if(pstr != NULL)
						{
							*pstr = '\0';  // \r -> \0
							if(0 == strcmp(pstr, pssid))
							{
								ret = 0;
							}
						}
					}
				}
			}
		}
		if(0 == ret)
		{
			while(1)
			{
				ret = sx_ulpgn_get_ipaddress();
				if(0 == ret)
				{
					ret = sx_ulpgn_socket_init();
					break;
				}
			}
			break;
		}
		else
		{
			sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATWD\r", 3, 1000, ULPGN_RETURN_OK);
		}
    }
    sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    return ret;
}

int32_t sx_ulpgn_wifi_disconnect(void)
{
	uint8_t mutex_flag;

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

	if(0 != is_sx_ulpgn_wifi_connect())
    {
    	/* If Wifi is not connected, do nothing and return success. */
	    sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    	return 0;
    }


    sx_ulpgn_serial_escape();

    for (uint8_t i = 0; i < CREATEABLE_SOCKETS; i++)
    {
        if (0 != R_BYTEQ_Close(g_ulpgn_socket[i].socket_byteq_hdl))
        {
//            return -1;
        }
    }

    sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATWD\r", 3, 1000, ULPGN_RETURN_OK);
    memset(g_sx_ulpgn_ipaddress, 0, sizeof(g_sx_ulpgn_ipaddress));
    memset(g_sx_ulpgn_subnetmask, 0, sizeof(g_sx_ulpgn_subnetmask));
    memset(g_sx_ulpgn_gateway, 0, sizeof(g_sx_ulpgn_gateway));

    sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    return 0;
}

int32_t sx_ulpgn_wifi_off(void)
{

    sx_ulpgn_wifi_disconnect();

    R_SCI_Close(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT]);
    if(ULPGN_USE_UART_NUM == 2)
    {
        R_SCI_Close(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT]);
    }
    return 0;
}

int32_t is_sx_ulpgn_wifi_connect(void)
{
	int32_t ret = -1;

	if((g_sx_ulpgn_ipaddress[0] | g_sx_ulpgn_ipaddress[1] | g_sx_ulpgn_ipaddress[2] | g_sx_ulpgn_ipaddress[3])!= 0)
	{
		ret = 0;
	}
	return ret;
}

static int32_t sx_ulpgn_serial_escape()
{
//#if ULPGN_USE_UART_NUM == 1 // escape sequence is only needed for single socket
    if(ULPGN_USE_UART_NUM == 1)
    {
        R_BSP_SoftwareDelay(500, BSP_DELAY_MILLISECS);
//        vTaskDelay(500 / portTICK_PERIOD_MS);
        if (R_SCI_Send(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], "+++", 3) == SCI_SUCCESS)
        {
            //      transparent_mode = false;
            return 0;
        }
        else
        {
            return 1;
        }
    }
    return -1;
//#endif
}


int32_t sx_ulpgn_wifi_get_macaddr(uint8_t *pmacaddr)
{
    int32_t ret;
    uint8_t macaddr[6];
	uint8_t mutex_flag;

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

    if(pmacaddr == NULL){
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }

    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATW\r", 300, 3000, ULPGN_RETURN_OK);
    if (ret != 0)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }

    ret = sscanf((const char *)recvbuff, "%*[^\n]\n%*[^\n]\n%*[^\n]\nMac Addr     =   %2x:%2x:%2x:%2x:%2x:%2x\r", &macaddr[0], &macaddr[1], &macaddr[2], &macaddr[3], &macaddr[4], &macaddr[5]);

    if (ret == 6)
    {
        memcpy(pmacaddr, &macaddr[0], sizeof(macaddr));
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return 0;
    }
    else
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }
}

int32_t sx_ulpgn_wifi_scan(WIFIScanResult_t *results, uint8_t maxNetworks)
{
    int32_t ret;
    uint8_t idx = 0;
    uint8_t *bssid;
    char *ptr = recvbuff + 2;
	uint8_t mutex_flag;
    uint8_t retry_count;

    if ((NULL == results) || (0 == maxNetworks))
    {
    	return -1;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

    // TODO investigate why this never returns the full response
	for (retry_count = 0; retry_count < 3; retry_count++)
	{
        ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATWS\r", 500, 8000, ULPGN_RETURN_OK);
        if (ret == 0)
        {
        	if(ptr != '\0')
        	{
        		break;
        	}
        }
    }

