renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
	if(ret != 0)
	{
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
	}
	do
    {
		results[idx].cSSID[0] = '\0';
        if (strncmp(ptr, "ssid =", 6) != 0)
        {
            break; // end of list
        }
        // SSID
        ret = sscanf(ptr, "ssid = %[^\r]", results[idx].cSSID);
        if (ret != 1)
		{
        	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
			return 0;
		}
        while(*(ptr++) != '\n');

        // BSSID
        bssid = &results[idx].ucBSSID[0];
        ret = sscanf(ptr, "bssid = %x:%x:%x:%x:%x:%x\r", &bssid[0], &bssid[1], &bssid[2], &bssid[3], &bssid[4], &bssid[5], &bssid[6]);
        if (ret != 6)
        {
        	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
			return 0;
        }
        while(*(ptr++) != '\n');

        ret = sscanf(ptr, "channel = %d\r", &results[idx].cChannel);
        if (ret != 1)
		{
			sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
			return 0;
		}
        while(*(ptr++) != '\n');

        ret = sscanf(ptr, "indicator = %d\r", &results[idx].cRSSI);
        if (ret != 1)
		{
			sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
			return 0;
		}
        while(*(ptr++) != '\n');

        if (strncmp(ptr, "security = NONE!", 16) == 0)
        {
            results[idx].xSecurity = eWiFiSecurityOpen;
            while(*(ptr++) != '\n');
        }
        else
        {
            while(*(ptr++) != '\n');
            if(*(ptr++) !='\r')
			{
				if (strncmp(ptr, "WPA", 3) == 0)
				{
					results[idx].xSecurity = eWiFiSecurityWPA;
				}
				else  if (strncmp(ptr, "RSN/WPA2", 8) == 0)
				{
					results[idx].xSecurity = eWiFiSecurityWPA2;
				}
				// Note WEP is not recognized by the modem
				while(*(ptr++) != '\n');
			}
        }

        while(*ptr != '\0' && *(ptr++) != '\n'); // end of record
    }
    while(++idx < maxNetworks);

	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    return 0;
}

int32_t sx_ulpgn_wifi_ping(uint8_t *pucIPAddr, uint16_t usCount, uint32_t ulIntervalMS)
{
    int32_t ret;
    uint16_t i;
	uint8_t mutex_flag;

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

	sprintf((char *)buff, "ATNPING=%d.%d.%d.%d,,%d\r", \
			(uint8_t)(pucIPAddr[0]),(uint8_t)(pucIPAddr[1]),(uint8_t)(pucIPAddr[2]),(uint8_t)(pucIPAddr[3]),\
			ulIntervalMS);

	for(i = 0; i<usCount; i++)
	{
		// TODO investigate why this never returns the full response
		ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, buff, 3, 8000, ULPGN_RETURN_OK);
		if (ret < 0)
		{
			sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
			return -1;
		}
	}

	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    return 0;
}

int32_t sx_ulpgn_get_ip(uint8_t *ucip_addr)
{
    int32_t ret;
    uint32_t temp_addr[4];
    uint32_t i = 0;
    char *buff = recvbuff;
	uint8_t mutex_flag;

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

    if(ucip_addr == NULL)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }

    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATNSET?\r", 500, 5000, ULPGN_RETURN_OK);
    if (ret != 0)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }
    if (buff[0] == '\n' && buff[1] == '\0')
    {
        buff += 2;
    }

    ret = sscanf((const char *)buff, "IP:%u.%u.%u.%u,", &temp_addr[0], &temp_addr[1],&temp_addr[2],&temp_addr[3]);


    if (ret != 4)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }

    for(i =0;i<4;i++){
           if(temp_addr[i]<=255){
               ucip_addr[i] = (uint8_t)temp_addr[i];
           }else{
           	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
               return -1;
           }
        }


	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    return 0;

}

uint8_t sx_ulpgn_get_avail_socket(void)
{
    for (int8_t i = 0; i < g_sx_ulpgn_cleateble_sockets; i++)
    {
        if (g_ulpgn_socket[i].socket_create_flag == 0)
        {
            return i;
        }
    }
    return 255;
}

int32_t sx_ulpgn_get_tcp_socket_status(uint8_t socket_no)
{
	if(socket_no >= g_sx_ulpgn_cleateble_sockets)
	{
	    return -1;
	}
	return g_ulpgn_socket[socket_no].socket_status;
}

int32_t sx_ulpgn_socket_create(uint8_t socket_no, uint32_t type, uint32_t ipversion)
{
    int32_t ret;

    if( xSemaphoreTake( g_sx_ulpgn_tx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
    {
        if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
        {
	#if DEBUGLOG == 1
			R_BSP_CpuInterruptLevelWrite (13);
			printf("sx_ulpgn_socket_create(%d)\r\n", socket_no);
			R_BSP_CpuInterruptLevelWrite (0);
	#endif
			if( g_ulpgn_socket[socket_no].socket_create_flag == 1)
			{
				( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
				return -1;
			}

	//#if ULPGN_USE_UART_NUM == 2
			if(ULPGN_USE_UART_NUM == 2)
			{
				ret = sx_ulpgn_change_socket_index(socket_no);
				if(ret != 0)
				{
					( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
					( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
					return -1;
				}
			}
	//#endif
			ret = sx_ulpgn_get_socket_status(socket_no);

			sprintf((char *)buff, "ATNSOCK=%d,%d\r", (uint8_t)(type), (uint8_t)(ipversion));

			ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, (char *)buff, 10, 200, ULPGN_RETURN_OK);
			if(ret != 0 && ret != -2)
			{
				( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
				return ret;
			}
			g_ulpgn_socket[socket_no].socket_create_flag = 1;
			if(ret == 0)
			{
				g_ulpgn_socket[socket_no].socket_status = ULPGN_SOCKET_STATUS_SOCKET;
				R_BYTEQ_Flush(g_ulpgn_socket[socket_no].socket_byteq_hdl);
			}
			//  ret = sx_ulpgn_serial_send_basic(socket_no, "ATNSTAT\r", 3, 200, ULPGN_RETURN_OK);

			ret = sx_ulpgn_get_socket_status(socket_no);

			/* Give back the socketInUse mutex. */
			( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
			( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
        }
        else
        {
			/* Give back the socketInUse mutex. */
			( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );

