renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
        }
    }
    else
    {
        return -1;
    }

    return 0;
}


int32_t sx_ulpgn_tcp_connect(uint8_t socket_no, uint32_t ipaddr, uint16_t port)
{
    int32_t ret;
    if( xSemaphoreTake( g_sx_ulpgn_tx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
    {
        if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
        {
			if( g_ulpgn_socket[socket_no].socket_create_flag  == 0)
			{
				/* Give back the socketInUse mutex. */
				( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
				return -1;
			}

	#if DEBUGLOG == 1
			R_BSP_CpuInterruptLevelWrite (13);
			printf("sx_ulpgn_tcp_connect(%d)\r\n", socket_no);
			R_BSP_CpuInterruptLevelWrite (0);
	#endif
	//#if ULPGN_USE_UART_NUM == 2
			if(ULPGN_USE_UART_NUM == 2)
			{
				ret = sx_ulpgn_change_socket_index(socket_no);
				if(ret != 0)
				{
					/* Give back the socketInUse mutex. */
					( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
					( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
					return -1;
				}
			}
	//#endif
			strcpy((char *)buff, "ATNCTCP=");
			sprintf((char *)buff + strlen((char *)buff), "%d.%d.%d.%d,%d\r", (uint8_t)(ipaddr >> 24), (uint8_t)(ipaddr >> 16), (uint8_t)(ipaddr >> 8), (uint8_t)(ipaddr), port);

	//#if ULPGN_USE_UART_NUM == 2
			if(ULPGN_USE_UART_NUM == 2)
			{
				ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, (char *)buff, 300, 15000, ULPGN_RETURN_OK);
			}
	//#endif
			if(ULPGN_USE_UART_NUM == 1)
			{
	//#if ULPGN_USE_UART_NUM == 1
				ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, (char *)buff, 300, 15000, ULPGN_RETURN_CONNECT);
	//#endif
			}
			if(ret == 0)
			{
				g_ulpgn_socket[socket_no].socket_status = ULPGN_SOCKET_STATUS_CONNECTED;
			}


			/* Give back the socketInUse mutex. */
			( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
			( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
        }
        else
        {
			( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
        }
    }
    else
    {
        return -1;
    }
    return ret;

}

int32_t sx_ulpgn_tcp_send(uint8_t socket_no, const uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
    int32_t timeout;
    volatile int32_t sended_length;
    int32_t current_send_length;
    int32_t ret;
    sci_err_t ercd;
    TickType_t starttime;
	TickType_t stoptime;


    if( xSemaphoreTake( g_sx_ulpgn_tx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
    {
        if(0 == g_ulpgn_socket[socket_no].socket_create_flag )
        {
            /* Give back the socketInUse mutex. */
            ( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
            return -1;
        }
        if(ULPGN_SOCKET_STATUS_CONNECTED != g_ulpgn_socket[socket_no].socket_status)
        {
            /* Give back the socketInUse mutex. */
#if DEBUGLOG == 1
            R_BSP_CpuInterruptLevelWrite (13);
            printf("status not connect.\r\n");
            R_BSP_CpuInterruptLevelWrite (0);
#endif
            ( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
            return -1;
        }

        if(ULPGN_USE_UART_NUM == 2)
        {
        	if(socket_no != current_socket_index)
        	{
        	    if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
        	    {
                    ( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
                    return 0;
        	    }
                ret = sx_ulpgn_change_socket_index(socket_no);
                ( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
                if(ret != 0)
                {
                    /* Give back the socketInUse mutex. */
                    ( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
                    return -1;
                }
        	}
        }

#if DEBUGLOG == 1
        R_BSP_CpuInterruptLevelWrite (13);
        printf("sx_ulpgn_tcp_send(%d)\r\n", socket_no);
        R_BSP_CpuInterruptLevelWrite (0);
#endif

        sended_length = 0;
        tcp_timeout_init(socket_no, timeout_ms, 0);

        timeout = 0;

        while(sended_length < length)
        {
            if(length - sended_length > g_sx_ulpgn_tx_busiz_data)
            {
                current_send_length = g_sx_ulpgn_tx_busiz_data;
            }
            else
            {
                current_send_length = length - sended_length;
            }

            if(current_send_length > 1420)
            {
            	current_send_length = 1420;
            }

            g_sx_ulpgn_uart_teiflag[ULPGN_UART_DATA_PORT] = 0;
            ercd = R_SCI_Send(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], (uint8_t *)pdata + sended_length, current_send_length);
            if(SCI_SUCCESS != ercd)
            {
                /* Give back the socketInUse mutex. */
                ( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
                return -1;
            }

            while(1)
            {
                if(0 != g_sx_ulpgn_uart_teiflag[ULPGN_UART_DATA_PORT])
                {
                    break;
                }
                vTaskDelay(1);
            }

            sended_length += current_send_length;

            if(-1 == tcp_check_timeout(socket_no, 0))
            {
              break;
            }

        }

#if DEBUGLOG == 1
        R_BSP_CpuInterruptLevelWrite (13);
        printf("tcp %d byte send\r\n", sended_length);
        R_BSP_CpuInterruptLevelWrite (0);
#endif

        /* Give back the socketInUse mutex. */
        ( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
    }
    else
    {
        return 0;
    }
    return sended_length;
}

int32_t sx_ulpgn_tcp_recv(uint8_t socket_no, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
    sci_err_t ercd;
    uint32_t recvcnt = 0;
    int32_t ret;
    byteq_err_t byteq_ret;
#if DEBUGLOG == 1
    TickType_t tmptime2;
#endif
    TickType_t tmptime1;

    if(ULPGN_USE_UART_NUM == 2)
    {
        if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
        {
			if(0 == g_ulpgn_socket[socket_no].socket_create_flag)
			{
	            ( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				return -1;
			}

