renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
			if(ULPGN_SOCKET_STATUS_CONNECTED != g_ulpgn_socket[socket_no].socket_status)
			{
				/* Give back the socketInUse mutex. */
	#if DEBUGLOG == 1
				R_BSP_CpuInterruptLevelWrite (13);
				printf("status not connect.\r\n");
				R_BSP_CpuInterruptLevelWrite (0);
	#endif
	            ( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				return -1;
			}

	        if(ULPGN_USE_UART_NUM == 2)
	        {
	        	if(socket_no != current_socket_index)
	        	{
	        		( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
	        	    if( xSemaphoreTake( g_sx_ulpgn_tx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
	        	    {
	                    return 0;
	        	    }
	                if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
	                {
	                	( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
	                    return 0;
	                }
	                ret = sx_ulpgn_change_socket_index(socket_no);
	                ( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
	                if(ret != 0)
	                {
	                    /* Give back the socketInUse mutex. */
	                    ( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
	                    return -1;
	                }
	        	}
	        }

			if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
			{
				tcp_timeout_init(socket_no, timeout_ms, 1);
			}

			while(1)
			{
				R_BSP_CpuInterruptLevelWrite (15);
				byteq_ret = R_BYTEQ_Get(g_ulpgn_socket[current_socket_index].socket_byteq_hdl, (pdata + recvcnt));
				R_BSP_CpuInterruptLevelWrite (0);
				if(BYTEQ_SUCCESS == byteq_ret)
				{
	//	        	printf("%02x\r\n",*(pdata + recvcnt));
					recvcnt++;
					if(recvcnt >= length)
					{
						break;
					}
					continue;
				}
				if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
				{
					if(-1 == tcp_check_timeout(socket_no, 1))
					{
		#if DEBUGLOG == 1
						R_BSP_CpuInterruptLevelWrite (13);
	//	                printf("recv timeout.%d received. requestsize=%d,lastdata=%02x,data1=%02x\r\n",recvcnt,length,*(pdata + (recvcnt-1)),data1);
						R_BSP_CpuInterruptLevelWrite (0);
		#endif
						R_BSP_NOP();
						break;
					}
					vTaskDelay(1);
				}
			}
			if(recvcnt == 0)
			{
				ret = sx_ulpgn_get_socket_status(socket_no);
				if(ret != ULPGN_SOCKET_STATUS_CONNECTED)
				{
					/* Give back the socketInUse mutex. */
					( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
					return 0;
				}
				/* socket is not closed, and recieve data size is 0. */
				( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				return 0;
			}
			/* socket is not closed, and recieve data size is 0. */
			( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
	#if DEBUGLOG == 1
			tmptime2 = xTaskGetTickCount();
			R_BSP_CpuInterruptLevelWrite (13);
			printf("r:%06d:tcp %ld byte received.reqsize=%ld,%x\r\n", tmptime2, recvcnt, length, (uint32_t)pdata);
			R_BSP_CpuInterruptLevelWrite (0);
	#endif
        }

    }

    if(ULPGN_USE_UART_NUM == 1)
    {
		if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
		{
			if(0 == g_ulpgn_socket[socket_no].socket_create_flag)
			{
				/* Give back the socketInUse mutex. */
				( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				return -1;
			}

	#if DEBUGLOG == 1
			R_BSP_CpuInterruptLevelWrite (13);
			printf("sx_ulpgn_tcp_recv(%d)\r\n", socket_no);
			R_BSP_CpuInterruptLevelWrite (0);
	#endif
			if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
			{
				timeout_init(1, timeout_ms);
			}
			while(1)
			{
	//#if ULPGN_USE_UART_NUM == 1
				if(ULPGN_USE_UART_NUM == 1)
				{
					ercd = R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], (pdata + recvcnt), 1);
					if(SCI_SUCCESS == ercd)
					{
						recvcnt++;
						if(recvcnt >= length)
						{
							break;
						}
					}
					if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
					{
						if(-1 == check_timeout(1, 0))
						{
							break;
						}
//						vTaskDelay(1);
					}
				}
	//#endif
			}
	#if DEBUGLOG == 1
			tmptime2 = xTaskGetTickCount();
			R_BSP_CpuInterruptLevelWrite (13);
			printf("r:%06d:tcp %ld byte received.reqsize=%ld,%x\r\n", tmptime2, recvcnt, length, (uint32_t)pdata);
			R_BSP_CpuInterruptLevelWrite (0);
	#endif

			/* Give back the socketInUse mutex. */
			( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
		}
		else
		{
			return 0;
		}
    }
    return recvcnt;
}

int32_t sx_ulpgn_serial_tcp_recv_timeout_set(uint8_t socket_no, TickType_t timeout_ms)
{
    g_sl_ulpgn_tcp_recv_timeout = timeout_ms;
    return 0;
}

int32_t sx_ulpgn_tcp_disconnect(uint8_t socket_no)
{
    int32_t ret = 0;
    if( xSemaphoreTake( g_sx_ulpgn_tx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
    {
        if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) == pdTRUE )
        {
			if(1 == g_ulpgn_socket[socket_no].socket_create_flag)
			{
	#if DEBUGLOG == 1
				R_BSP_CpuInterruptLevelWrite (13);
				printf("sx_ulpgn_tcp_disconnect(%d)\r\n", socket_no);
				R_BSP_CpuInterruptLevelWrite (0);
	#endif
	//#if ULPGN_USE_UART_NUM == 2
				if(ULPGN_USE_UART_NUM == 2)
				{
					ret = sx_ulpgn_change_socket_index(socket_no);
					if(ret != 0)
					{
						/* Give back the socketInUse mutex. */
						( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
						( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
						return -1;
					}
				}
	//#endif

	//#if ULPGN_USE_UART_NUM == 1
				if(ULPGN_USE_UART_NUM == 1)
				{
					R_BSP_SoftwareDelay(201, BSP_DELAY_MILLISECS); /* 1s */
					R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], SCI_CMD_RX_Q_FLUSH, NULL);
					ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "+++", 3, 1000, ULPGN_RETURN_OK);
				}
	//#endif
				ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATNCLOSE\r", 3, 1000, ULPGN_RETURN_OK);
				if(0 == ret)
				{
					g_ulpgn_socket[socket_no].socket_create_flag = 0;
					g_ulpgn_socket[socket_no].socket_status = ULPGN_SOCKET_STATUS_CLOSED;
	//#if ULPGN_USE_UART_NUM == 2
					if(ULPGN_USE_UART_NUM == 2)
					{
						R_BYTEQ_Flush(g_ulpgn_socket[socket_no].socket_byteq_hdl);
					}
					R_BSP_SoftwareDelay(500, BSP_DELAY_MILLISECS);
	//#endif
				}
				/* Give back the socketInUse mutex. */
				( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
			}
			else
			{
				/* Give back the socketInUse mutex. */
				( void ) xSemaphoreGive( g_sx_ulpgn_rx_semaphore );
				( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
				return -1;
			}
        }
        else
        {
			( void ) xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
        }
    }
    else
    {
        return -1;
    }
    return ret;

