renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
}

int32_t sx_ulpgn_get_ipaddress(void)
{

    uint32_t result;
    uint32_t ipaddr[4];
    uint32_t subnetmask[4];
    uint32_t gateway[4];
    int32_t func_ret;
    int32_t scanf_ret;
    uint32_t count;

    func_ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATNSET=\?\r", 100, 3000, ULPGN_RETURN_OK);
    if(func_ret != 0)
    {
        return -1;
    }
    scanf_ret = sscanf((const char *)recvbuff, "IP:%d.%d.%d.%d, Mask:%d.%d.%d.%d, Gateway:%d.%d.%d.%d\r\n", \
                       &ipaddr[0], &ipaddr[1], &ipaddr[2], &ipaddr[3], \
                       &subnetmask[0], &subnetmask[1], &subnetmask[2], &subnetmask[3], \
                       &gateway[0], &gateway[1], &gateway[2], &gateway[3]);
    if(scanf_ret != 12)
    {
        return -1;
    }
    if((ipaddr[0] | ipaddr[1] | ipaddr[2] | ipaddr[3]) == 0)
    {
        return -1;
    }
    g_sx_ulpgn_ipaddress[0] = ipaddr[0];
    g_sx_ulpgn_ipaddress[1] = ipaddr[1];
    g_sx_ulpgn_ipaddress[2] = ipaddr[2];
    g_sx_ulpgn_ipaddress[3] = ipaddr[3];
    g_sx_ulpgn_subnetmask[0] = subnetmask[0];
    g_sx_ulpgn_subnetmask[1] = subnetmask[1];
    g_sx_ulpgn_subnetmask[2] = subnetmask[2];
    g_sx_ulpgn_subnetmask[3] = subnetmask[3];
    g_sx_ulpgn_gateway[0] = gateway[0];
    g_sx_ulpgn_gateway[1] = gateway[1];
    g_sx_ulpgn_gateway[2] = gateway[2];
    g_sx_ulpgn_gateway[3] = gateway[3];
    return 0;
}

int32_t sx_ulpgn_dns_query(const char *ptextstring, uint8_t *ip_addr)
{
    uint32_t result;
    int32_t func_ret;
    int32_t scanf_ret;
    uint32_t temp_addr[4];
    int32_t i = 0;
    uint8_t mutex_flag;

    if(ip_addr == NULL){
        return -1;
    }

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}


    strcpy((char *)buff, "ATNDNSQUERY=");
    sprintf((char *)buff + strlen((char *)buff), "%s\r", ptextstring);

    func_ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, (char *)buff, 3, 3000, ULPGN_RETURN_OK);
    if(func_ret != 0)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }
    scanf_ret = sscanf((const char *)recvbuff, "%lu\r\n%u.%u.%u.%u\r\n", &result, &temp_addr[0], &temp_addr[1], &temp_addr[2], &temp_addr[3]);
    if(scanf_ret != 5)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }
    if(result != 1)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }

    for(i =0;i<4;i++){
       if(temp_addr[i]<=255){
           ip_addr[i] = (uint8_t)temp_addr[i];
       }else{
           sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
           return -1;
       }
    }
	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);

    return 0;

}

int32_t sx_ulpgn_set_power_mode(const uint8_t powermode ,const void * submode)
{
    uint32_t result;
    int32_t func_ret;
    int32_t scanf_ret;
    uint8_t mutex_flag;

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

    strcpy((char *)buff, "\ATWPM=");
    sprintf((char *)buff + strlen((char *)buff), "%u\r", powermode);

    func_ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, (char *)buff, 3, 3000, ULPGN_RETURN_OK);
    if(func_ret != 0)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }
    scanf_ret = sscanf((const char *)recvbuff, "%lu\r\n", &result);
    if((scanf_ret != 1)&& (result != 0))
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }

	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    return 0;

}

int32_t sx_ulpgn_get_power_mode(uint8_t *power_mode ,void * sub_mode)
{
    uint32_t result;
    int32_t func_ret;
    int32_t scanf_ret;
    uint8_t response_power_mode[10]={0};
    const char * power_mode_dict[2]={"Max Perf","Power Save"};
    uint8_t mutex_flag;

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != sx_ulpgn_serial_send_basic_take_mutex(mutex_flag))
	{
    	return -1;
	}

    strcpy((char *)buff, "\ATWPM=?");

    func_ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, (char *)buff, 3, 3000, ULPGN_RETURN_OK);
    if(func_ret != 0)
    {
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }
    scanf_ret = sscanf((const char *)recvbuff, "Power Mode = %10s \r\n", response_power_mode);
    if(strcmp((const char *)response_power_mode,power_mode_dict[0]) )
    {
        *power_mode=0;
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return 0;
    }else if(strcmp((const char *)response_power_mode,power_mode_dict[1]))
    {
        *power_mode=1;
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return 0;
    }else{
    	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
        return -1;
    }

	sx_ulpgn_serial_send_basic_give_mutex(mutex_flag);
    return 0;

}



static int32_t sx_ulpgn_serial_send_basic_take_mutex(uint8_t mutex_flag)
{
	if(0 != (mutex_flag & MUTEX_TX))
	{
		if( xSemaphoreTake( g_sx_ulpgn_tx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
		{
        	return -1;
		}
	}

	if(0 != (mutex_flag & MUTEX_RX))
	{
		if( xSemaphoreTake( g_sx_ulpgn_rx_semaphore, xMaxSemaphoreBlockTime ) != pdTRUE )
		{
			if(0 != (mutex_flag & MUTEX_TX))
			{
				xSemaphoreGive( g_sx_ulpgn_tx_semaphore );
			}
			return -1;
		}
	}
	return 0;
}

static void sx_ulpgn_serial_send_basic_give_mutex(uint8_t mutex_flag)
{
	if(0 != (mutex_flag & MUTEX_RX))
	{
		xSemaphoreGive( g_sx_ulpgn_rx_semaphore);
	}
	if(0 != (mutex_flag & MUTEX_TX))
	{
		xSemaphoreGive( g_sx_ulpgn_tx_semaphore);
	}
	return;
}
uint8_t last_data[ULPGN_RETURN_TEXT_LENGTH];

static int32_t sx_ulpgn_serial_send_basic(uint8_t serial_ch_id, const char *ptextstring, uint16_t response_type, uint16_t timeout_ms, sx_ulpgn_return_code_t expect_code)
{
#if DEBUGLOG == 1
    TickType_t tmptime1, tmptime2;
#endif
    volatile int32_t timeout;
    sci_err_t ercd;
    uint32_t recvcnt = 0;
    uint8_t receive_data;
    uint8_t last_data_cnt = 0;
    uint8_t retry_count;

	for (retry_count = 0; retry_count < 10; retry_count++)
    {
		last_data_cnt = 0;
	    memset(recvbuff, 0, sizeof(recvbuff));
	    memset(last_data, 0, sizeof(last_data));

