renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
	    timeout_init(serial_ch_id, timeout_ms);

	    //uart_string_printf(ptextstring);
	    //uart_string_printf("\r\n");
	    if(ptextstring != NULL)
	    {
	        timeout = 0;
	        recvcnt = 0;
	        g_sx_ulpgn_uart_teiflag[serial_ch_id] = 0;
	        R_SCI_Control(sx_ulpgn_uart_sci_handle[serial_ch_id], SCI_CMD_RX_Q_FLUSH, NULL);
	        ercd = R_SCI_Send(sx_ulpgn_uart_sci_handle[serial_ch_id], (uint8_t *)ptextstring, (uint16_t)strlen((const char *)ptextstring));
	        if(SCI_SUCCESS != ercd)
	        {
	            return -1;
	        }

	        while(1)
	        {
	            if(0 != g_sx_ulpgn_uart_teiflag[serial_ch_id])
	                //      ercd = R_SCI_Control(sx_ulpgn_uart_sci_handle, SCI_CMD_TX_Q_BYTES_FREE, &non_used);
	                //      if(non_used == SCI_TX_BUSIZ)
	            {
	                break;
	            }
	            if(-1 == check_timeout(serial_ch_id, recvcnt))
	            {
	                timeout = 1;
	                break;
	            }
	        }
	        if(timeout == 1)
	        {
	#if DEBUGLOG == 1
	            R_BSP_CpuInterruptLevelWrite (13);
	            printf("timeout.\r\n", tmptime1, ptextstring);
	            R_BSP_CpuInterruptLevelWrite (0);
	#endif
	            return -1;
	        }

	#if DEBUGLOG == 1
	        tmptime1 = xTaskGetTickCount();
	        if(ptextstring[strlen((const char *)ptextstring) - 1] != '\r')
	        {
	            R_BSP_CpuInterruptLevelWrite (13);
	            printf("s:%06d:%s\r\n", tmptime1, ptextstring);
	            R_BSP_CpuInterruptLevelWrite (0);
	        }
	        else
	        {
	            R_BSP_CpuInterruptLevelWrite (13);
	            printf("s:%06d:%s", tmptime1, ptextstring);
	            printf("\n");
	            R_BSP_CpuInterruptLevelWrite (0);
	        }
	#endif
	    }
	    while(1)
	    {
	        ercd = R_SCI_Receive(sx_ulpgn_uart_sci_handle[serial_ch_id], &receive_data, 1);
	        if(SCI_SUCCESS == ercd)
	        {
	        	recvbuff[recvcnt] = receive_data;
	            recvcnt++;
	            if(last_data_cnt < (ULPGN_RETURN_TEXT_LENGTH - 2))
	            {
	            	last_data[last_data_cnt] = receive_data;
	            	last_data_cnt++;
	            }
	            else
	            {
	            	memmove(&last_data[0],&last_data[1],ULPGN_RETURN_TEXT_LENGTH - 2);
	            	last_data_cnt--;
	            	last_data[last_data_cnt] = receive_data;
	            	last_data_cnt++;
	            }
	            bytetimeout_init(serial_ch_id, response_type);
	            if(recvcnt < 4)
	            {
	                continue;
	            }
	            if(recvcnt == sizeof(recvbuff) - 2)
	            {
	                break;
	            }
	        }
	        if(-1 == check_bytetimeout(serial_ch_id, recvcnt))
	        {
	            break;
	        }
	        if(-1 == check_timeout(serial_ch_id, recvcnt))
	        {
	            timeout = 1;
	            break;
	        }
	    }
	    if (0 == timeout)
	    {
			/* Success */
		}
	    else if (1 == timeout && 5 == retry_count)
	    {
            /* Error, no response */
	        return -1;
	    }
	    else
	    {
			/* Retry */
			continue;
		}

	    if(recvcnt == sizeof(recvbuff) - 2)
	    {
	        while(1)
	        {
				ercd = R_SCI_Receive(sx_ulpgn_uart_sci_handle[serial_ch_id], &receive_data, 1);
				if(SCI_SUCCESS == ercd)
				{
					memmove(&last_data[0],&last_data[1],ULPGN_RETURN_TEXT_LENGTH - 2);
	            	last_data_cnt--;
	            	last_data[last_data_cnt] = receive_data;
	            	last_data_cnt++;
					bytetimeout_init(serial_ch_id, response_type);
				}
				if(-1 == check_bytetimeout(serial_ch_id, recvcnt))
				{
					break;
				}
	        }
	    }

	#if DEBUGLOG == 1
	    tmptime2 = xTaskGetTickCount();
	    if(recvbuff[recvcnt - 1] != '\r')
	    {
	        recvbuff[recvcnt] = '\r';
	        recvbuff[recvcnt + 1] = '\0';
	    }
	    else
	    {
	        recvbuff[recvcnt] = '\0';
	    }
	    printf("r:%06d:%s", tmptime2, recvbuff);
	#endif
	    /* Response data check */
	    if(recvcnt < strlen((const char *)ulpgn_result_code[expect_code][g_sx_ulpgn_return_mode]))
	    {
	        return -1;
	    }

	    const char* expected_result = ulpgn_result_code[expect_code][g_sx_ulpgn_return_mode];
	    const uint32_t expected_len = strlen(expected_result);
	    uint32_t expected_offset = 0;

	    if(0 != strncmp((const char *)&last_data[last_data_cnt - strlen((const char *)ulpgn_result_code[expect_code][g_sx_ulpgn_return_mode]) ],
	                    (const char *)ulpgn_result_code[expect_code][g_sx_ulpgn_return_mode], strlen((const char *)ulpgn_result_code[expect_code][g_sx_ulpgn_return_mode])))
	    {
	        if(0 == strncmp((const char *)&last_data[last_data_cnt - strlen((const char *)ulpgn_result_code[expect_code][g_sx_ulpgn_return_mode]) ],
	                        (const char *)ulpgn_result_code[ULPGN_RETURN_BUSY][g_sx_ulpgn_return_mode], strlen((const char *)ulpgn_result_code[ULPGN_RETURN_BUSY][g_sx_ulpgn_return_mode])))
	        {
	            /* busy */
	            return -2;
	        }

		    if (5 == retry_count)
		    {
	            /* Error */
		        return -1;
			}
	    }
	    else
	    {
			/* Success */
			break;
		}
	}

    return 0;
}



/* return code: from 0 to 5 : socket status
 *              -1 : Error
 * */
static int32_t sx_ulpgn_get_socket_status(uint8_t socket_no)
{
    int32_t i;
    int32_t ret;
    char * str_ptr;
    uint8_t str[3][10];

    ret = sx_ulpgn_serial_send_basic(ULPGN_UART_COMMAND_PORT, "ATNSTAT\r", 3, 200, ULPGN_RETURN_OK);
    if(ret != 0)
    {
        return -1;
    }

    str_ptr = strchr((const char *)recvbuff, ',');
    if(str_ptr != NULL)
    {
        for(i = 0; i < ULPGN_SOCKET_STATUS_MAX; i++)
        {
            if(0 == strncmp((const char *)recvbuff, (const char *)ulpgn_socket_status[i], ((uint32_t)str_ptr - (uint32_t)recvbuff)))
            {
                break;
            }
        }
    }
    if(i < ULPGN_SOCKET_STATUS_MAX)
    {
        return i;
    }
    return -1;
}

//#if ULPGN_USE_UART_NUM == 2
static int32_t sx_ulpgn_change_socket_index(uint8_t socket_no)
{
#if DEBUGLOG == 1
    TickType_t tmptime1, tmptime2;
#endif
    volatile int32_t timeout;
    sci_err_t ercd;
    uint32_t receive_count = 0;
    int32_t ret = 0;
    uint16_t i;
    uint16_t stored_data_size = 0;
    uint16_t stored_response_size = 0;
    uint32_t previous_socket_store_data_size = 0;
    uint16_t read_data_size;
    uint8_t before_socket_no;
    int8_t receive_ret;
    uint8_t temprary_buff[64];

    uint32_t previous_atustat_sent,now_atustat_sent,atustat_recv,dummy;
    uint8_t sequence;
    uint8_t resequence_flag;
    uint8_t zero_cnt;

    if(ULPGN_USE_UART_NUM == 2)
    {
  
    	if(socket_no != current_socket_index)
        {
    		sequence = 0;
            before_socket_no = current_socket_index;
            stored_data_size = 0;
            zero_cnt = 0;

