renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
            sprintf((char *)buff, "ATNSOCKINDEX=%d\r", socket_no);

            ret = sx_ulpgn_check_uart_state(100, 400, &atustat_recv, &previous_atustat_sent);
            if(ret != 0)
            {
            	return -1;
            }
			R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);

            while(sequence < 0x80)
            {
            	switch(sequence)
            	{
            		case 0:
            			/* Read the remaining data three times and proceed to the next step without data. */
            			resequence_flag = 0;
                        /* Enable temporary byte que(default byte que). */
                        g_temporary_byteq_enable_flag = 1;
                        ret = sx_ulpgn_check_uart_state(100, 400, &atustat_recv, &now_atustat_sent);
                        if(ret != 0)
                        {
							ret = -1;
							sequence = 0x80;
							break;
                        }

                        do{

        					if(SCI_SUCCESS != R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
        					{
    							ret = -1;
    							sequence = 0x80;
    							break;
        					}
        					if(stored_data_size > 0)
        					{
        						resequence_flag = 1;
        						zero_cnt = 0;
        						if(sizeof(temprary_buff) >= stored_data_size)
            					{
            						read_data_size = stored_data_size;
            					}
            					else
            					{
            						read_data_size = sizeof(temprary_buff);
            					}

            					R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], temprary_buff, read_data_size);

            					for(i = 0; i < read_data_size; i++ )
            					{
            						if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_ulpgn_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
									{
            			                g_ulpgn_socket[current_socket_index].socket_recv_error_count++;
									}
            					}

            					stored_data_size -= read_data_size;
        					}
        					else
        					{
        					}
        				}while(stored_data_size > 0);
                        if(now_atustat_sent == previous_atustat_sent)
                        {
    						zero_cnt++;
                        }
                        else
                        {
    						zero_cnt = 0;
                        }
                        previous_atustat_sent = now_atustat_sent;
            			if(zero_cnt < 2)
            			{
        					R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);
            				sequence = 0;
            			}
            			else
            			{
        					R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);
        					zero_cnt = 0;
            				sequence = 2;
            			}
            			break;
            		case 2:
                        receive_count = 0;
                        receive_ret = -1;
                        timeout = 0;
                        g_sx_ulpgn_uart_teiflag[ULPGN_UART_COMMAND_PORT] = 0;

                        /* Send ATNSOCKINDEX command. */

                        g_sockindex_command_flag =1;
						ercd = R_SCI_Send(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], (uint8_t *)buff, strlen((const char *)buff));

                        if(SCI_SUCCESS != ercd)
                        {
							ret = -1;
							sequence = 0x80;
							break;
                        }


                        /* Wait to send command. */
                        while(0 == g_sx_ulpgn_uart_teiflag[ULPGN_UART_COMMAND_PORT]);
                    	g_sockindex_command_flag =0;

                    	/* Just before the socket is switched to the next socket, secure the number of received data in the previous_socket_store_data_size. */
    					if(SCI_SUCCESS != R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
    					{
							ret = -1;
							sequence = 0x80;
							break;
    					}
                        /* Initualize command response. */
                        bytetimeout_init(ULPGN_UART_COMMAND_PORT, 1000);

                        /* Check stored data of command return code. */
                        do{

            	            if(SCI_SUCCESS != R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_response_size))
            	            {
								ret = -1;
								sequence = 0x80;
								break;
            	            }
                            if(-1 == check_bytetimeout(ULPGN_UART_COMMAND_PORT, 1000))
                            {
								ret = -1;
								sequence = 0x80;
								break;
                            }

                        }while(2 > stored_response_size);

                        /* Get command return code. */
                    	ercd = R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], recvbuff, 2);

                    	if(SCI_SUCCESS != ercd)
                        {
							ret = -1;
							sequence = 0x80;
							break;
                        }

                        /* Parse command return code. */
                    	if(recvbuff[1]=='\r')
                    	{
                    		switch(recvbuff[0])
                    		{
                    			case '0':
									/* change socket index to next. */
									current_socket_index = socket_no;

			                        ret = sx_ulpgn_check_uart_state(100, 400, &atustat_recv, &now_atustat_sent);
			                        if(ret != 0)
			                        {
										ret = -1;
										sequence = 0x80;
										break;
			                        }

			        				if(stored_data_size > 0)
			        				{
			        						previous_socket_store_data_size = now_atustat_sent - previous_atustat_sent;
											ULPGN_HSUART1_RTS_PODR = 0;
											/* Copy data(which stored during socket switching) from temporary buff to current socekt buff. */
											while(previous_socket_store_data_size > 0)
											{
												if(SCI_SUCCESS != R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
												{
													ret = -1;
													sequence = 0x80;
													break;
												}
												if(stored_data_size > 0)
												{
													if(sizeof(temprary_buff) >= stored_data_size)
													{
														read_data_size = stored_data_size;
													}
													else
													{
														read_data_size = sizeof(temprary_buff);
													}

													if(read_data_size > previous_socket_store_data_size)
													{
														read_data_size = previous_socket_store_data_size;
													}
													if(SCI_SUCCESS != R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], temprary_buff, read_data_size))
													{
														ret = -1;
														sequence = 0x80;
														break;
													}
													else
													{
														for(i = 0; i < read_data_size; i++ )
														{
															if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_ulpgn_socket[before_socket_no].socket_byteq_hdl, *(temprary_buff + i)))
															{
																g_ulpgn_socket[before_socket_no].socket_recv_error_count++;
															}
														}
														previous_socket_store_data_size -= read_data_size;
													}
												}
											}
			        				}
			        				else
			        				{
										ULPGN_HSUART1_RTS_PODR = 0;
			        				}
//			        				R_BSP_InterruptsDisable();
									/* Copy data(which stored during socket switching) from temporary buff to next socekt buff. */
									do{

