renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
										if(SCI_SUCCESS != R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
										{
											ret = -1;
											break;
										}
										if(sizeof(temprary_buff) >= stored_data_size)
										{
											read_data_size = stored_data_size;
										}
										else
										{
											read_data_size = sizeof(temprary_buff);
										}

										R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], temprary_buff, read_data_size);

										for(i = 0; i < read_data_size; i++ )
										{
											R_BYTEQ_Put(g_ulpgn_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i));
										}

										stored_data_size -= read_data_size;

									}while(stored_data_size > 0);
//			        				R_BSP_InterruptsEnable();
									/* Disable temporary byte que(default byte que). */
//#endif

									g_temporary_byteq_enable_flag = 0;
									ret = 0;
									sequence = 0x80;
									break;
                    			case '7':  /* switch(recvbuff[0]) */
                                    /* If dont change socket because of wifi module buzy, copy data from temporary buff to socekt buff
                                     * and retry change socket command. */

                 		            ULPGN_HSUART1_RTS_PODR = 0;

                					/* Wait 100us for module to complate send data. */
                					R_BSP_SoftwareDelay(100, BSP_DELAY_MICROSECS);
                		            ULPGN_HSUART1_RTS_PODR = 1;

                                    /* Copy data(which stored during socket switching) from temporary buff to current socekt buff. */
                					do{

                			            if(SCI_SUCCESS != R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
                			            {
        									ret = -1;
        									sequence = 0x80;
                			            }
                			            if(stored_data_size > 0)
                			            {
											if(sizeof(temprary_buff) >= stored_data_size)
											{
												read_data_size = stored_data_size;
											}
											else
											{
												read_data_size = sizeof(temprary_buff);
											}

											R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], temprary_buff, read_data_size);

											for(i = 0; i < read_data_size; i++ )
											{
												if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_ulpgn_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
												{
													g_ulpgn_socket[current_socket_index].socket_recv_error_count++;
												}
											}

											stored_data_size -= read_data_size;
                			            }
									}while(stored_data_size > 0);
                					sequence = 0;
                    				break;
                        		default:   /* switch(recvbuff[0]) */
                        			/* This is command error and recovery socket status. */
									ret = -1;
									sequence = 0x80;
									break;
                    		}   /* end of switch(recvbuff[0]) */
                    	}
                    	else
                    	{
                           	ret = -1;
                    		sequence = 0x80;
                    	}
            			break;
            	}
            }
            
			if(-1 == ret)
			{
				
				R_BSP_InterruptsDisable();

				/* Copy data(which stored during socket switching) from temporary buff to current socekt buff. */
				do{						

					if(SCI_SUCCESS != R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
					{
						break;
					}
					if(stored_data_size > 0)
					{
						if(sizeof(temprary_buff) >= stored_data_size)
						{
							read_data_size = stored_data_size;
						}
						else
						{
							read_data_size = sizeof(temprary_buff);
						}

						R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_DATA_PORT], temprary_buff, read_data_size);

						for(i = 0; i < read_data_size; i++ )
						{
							if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_ulpgn_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
							{
								g_ulpgn_socket[current_socket_index].socket_recv_error_count++;
							}
						}
						stored_data_size -= read_data_size;
					}
				}while(stored_data_size > 0);
				
				/* Disable temporary byte que(default byte que). */
				g_temporary_byteq_enable_flag = 0;
				ULPGN_HSUART1_RTS_PODR = 0;

				R_BSP_InterruptsEnable();
				
			}
            
        }
    
    }
    
    return ret;
}
//#endif

static int32_t sx_ulpgn_check_uart_state(uint16_t response_type, uint16_t timeout_ms,uint32_t *uart_receive_status, uint32_t *uart_send_status){

#if DEBUGLOG == 1
    TickType_t tmptime1, tmptime2;
#endif

    volatile int32_t timeout;
    sci_err_t ercd;
    uint32_t recvcnt = 0;
    uint8_t receive_data;
    uint8_t last_data_cnt = 0;
    uint8_t retry_count;
    uint8_t ptextstring[] = "ATUSTAT\r";
    uint8_t presponsestring[] = "recv=%lu sent=%lu\r\n%d\r";
    uint32_t ret;
    uint32_t previous_atustat_sent,now_atustat_sent,atustat_recv;

	for (retry_count = 0; retry_count < 10; retry_count++)
    {
		last_data_cnt = 0;
	    memset(recvbuff, 0, sizeof(recvbuff));
	    memset(last_data, 0, sizeof(last_data));

	    timeout_init(ULPGN_UART_COMMAND_PORT, timeout_ms);

	    if(ptextstring != NULL)
	    {
	        timeout = 0;
	        recvcnt = 0;
	        g_sx_ulpgn_uart_teiflag[ULPGN_UART_COMMAND_PORT] = 0;
	        R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], SCI_CMD_RX_Q_FLUSH, NULL);
	        ercd = R_SCI_Send(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], (uint8_t *)ptextstring, (uint16_t)strlen((const char *)ptextstring));
	        if(SCI_SUCCESS != ercd)
	        {
	            return -1;
	        }

	        while(1)
	        {
	            if(0 != g_sx_ulpgn_uart_teiflag[ULPGN_UART_COMMAND_PORT])
	            {
	                break;
	            }
	            if(-1 == check_timeout(ULPGN_UART_COMMAND_PORT, recvcnt))
	            {
	                timeout = 1;
	                break;
	            }
	        }
	        if(timeout == 1)
	        {
	#if DEBUGLOG == 1
	            R_BSP_CpuInterruptLevelWrite (13);
	            printf("timeout.\r\n", tmptime1, ptextstring);
	            R_BSP_CpuInterruptLevelWrite (0);
	#endif
	            return -1;
	        }

	#if DEBUGLOG == 1
	        tmptime1 = xTaskGetTickCount();
	        if(ptextstring[strlen((const char *)ptextstring) - 1] != '\r')
	        {
	            R_BSP_CpuInterruptLevelWrite (13);
	            printf("s:%06d:%s\r\n", tmptime1, ptextstring);
	            R_BSP_CpuInterruptLevelWrite (0);
	        }
	        else
	        {
	            R_BSP_CpuInterruptLevelWrite (13);
	            printf("s:%06d:%s", tmptime1, ptextstring);
	            printf("\n");
	            R_BSP_CpuInterruptLevelWrite (0);
	        }
	#endif
	    }
	    while(1)
	    {
	        ercd = R_SCI_Receive(sx_ulpgn_uart_sci_handle[ULPGN_UART_COMMAND_PORT], &receive_data, 1);
	        if(SCI_SUCCESS == ercd)
	        {
	        	recvbuff[recvcnt] = receive_data;
	            recvcnt++;
	            if(last_data_cnt < (ULPGN_RETURN_TEXT_LENGTH - 2))
	            {
	            	last_data[last_data_cnt] = receive_data;
	            	last_data_cnt++;
	            }
	            else
	            {
	            	memmove(&last_data[0],&last_data[1],ULPGN_RETURN_TEXT_LENGTH - 2);
	            	last_data_cnt--;
	            	last_data[last_data_cnt] = receive_data;
	            	last_data_cnt++;
	            }
	            bytetimeout_init(ULPGN_UART_COMMAND_PORT, response_type);
	            if(recvcnt < 4)
	            {
	                continue;
	            }
	            if(recvcnt == sizeof(recvbuff) - 2)
	            {
	                break;
	            }
	        }

