renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
            if(3 == sscanf(recvbuff,presponsestring,&atustat_recv, &now_atustat_sent, &ret))
            {
            	if(receive_data == '\r')
            	{
            		break;
            	}
            }

	        if(-1 == check_bytetimeout(ULPGN_UART_COMMAND_PORT, recvcnt))
	        {
	            break;
	        }
	        if(-1 == check_timeout(ULPGN_UART_COMMAND_PORT, recvcnt))
	        {
	            timeout = 1;
	            break;
	        }
	    }
	    if (0 == timeout)
	    {
			/* Success */
		}
	    else if (1 == timeout && 10 == retry_count)
	    {
            /* Error, no response */
	        return -1;
	    }
	    else
	    {
			/* Retry */
			continue;
		}


	#if DEBUGLOG == 1
	    tmptime2 = xTaskGetTickCount();
	    if(recvbuff[recvcnt - 1] != '\r')
	    {
	        recvbuff[recvcnt] = '\r';
	        recvbuff[recvcnt + 1] = '\0';
	    }
	    else
	    {
	        recvbuff[recvcnt] = '\0';
	    }
	    printf("r:%06d:%s", tmptime2, recvbuff);
	#endif
	    /* Response data check */
	    if(recvcnt < strlen((const char *)ulpgn_result_code[ULPGN_RETURN_OK][g_sx_ulpgn_return_mode]))
	    {
	        return -1;
	    }

	    const char* expected_result = ulpgn_result_code[ULPGN_RETURN_OK][g_sx_ulpgn_return_mode];
	    const uint32_t expected_len = strlen(expected_result);
	    uint32_t expected_offset = 0;

	    if(0 != strncmp((const char *)&last_data[last_data_cnt - strlen((const char *)ulpgn_result_code[ULPGN_RETURN_OK][g_sx_ulpgn_return_mode]) ],
	                    (const char *)ulpgn_result_code[ULPGN_RETURN_OK][g_sx_ulpgn_return_mode], strlen((const char *)ulpgn_result_code[ULPGN_RETURN_OK][g_sx_ulpgn_return_mode])))
	    {
	        if(0 == strncmp((const char *)&last_data[last_data_cnt - strlen((const char *)ulpgn_result_code[ULPGN_RETURN_OK][g_sx_ulpgn_return_mode]) ],
	                        (const char *)ulpgn_result_code[ULPGN_RETURN_BUSY][g_sx_ulpgn_return_mode], strlen((const char *)ulpgn_result_code[ULPGN_RETURN_BUSY][g_sx_ulpgn_return_mode])))
	        {
	            /* busy */
	            return -2;
	        }

		    if (10 == retry_count)
		    {
	            /* Error */
		        return -1;
			}
	    }
	    else
	    {
			/* Success */
	    	*uart_receive_status = atustat_recv;
	    	*uart_send_status = now_atustat_sent;
			break;
		}
	}

    return 0;
}

static void timeout_init(uint8_t serial_ch, uint32_t timeout_ms)
{
    starttime[serial_ch] = xTaskGetTickCount();
    endtime[serial_ch] = starttime[serial_ch] + timeout_ms;
    if(endtime[serial_ch] < starttime[serial_ch])
    {
        /* overflow */
        timeout_overflow_flag[serial_ch] = 1;
    }
    else
    {
        timeout_overflow_flag[serial_ch] = 0;
    }
}

static void tcp_timeout_init(uint8_t socket_no, uint32_t timeout_ms, uint8_t flag)
{
	TickType_t *starttime;
	TickType_t *thistime;
	TickType_t *endtime;
	uint8_t    *timeout_overflow_flag;
	if(0 == flag)
	{
		starttime             = &g_ulpgn_socket[socket_no].send_starttime ;
		thistime              = &g_ulpgn_socket[socket_no].send_thistime ;
		endtime               = &g_ulpgn_socket[socket_no].send_endtime ;
		timeout_overflow_flag = &g_ulpgn_socket[socket_no].send_timeout_overflow_flag;
	}
	else
	{
		starttime             = &g_ulpgn_socket[socket_no].recv_starttime ;
		thistime              = &g_ulpgn_socket[socket_no].recv_thistime ;
		endtime               = &g_ulpgn_socket[socket_no].recv_endtime ;
		timeout_overflow_flag = &g_ulpgn_socket[socket_no].recv_timeout_overflow_flag;
	}
    *starttime = xTaskGetTickCount();
    *endtime = *starttime + timeout_ms;
    if(*endtime < *starttime)
    {
        /* overflow */
        *timeout_overflow_flag = 1;
    }
    else
    {
        *timeout_overflow_flag = 0;
    }

}
static int32_t tcp_check_timeout(uint8_t socket_no, uint8_t flag)
{
	TickType_t *starttime;
	TickType_t *thistime;
	TickType_t *endtime;
	uint8_t    *timeout_overflow_flag;
	if(0 == flag)
	{
		starttime             = &g_ulpgn_socket[socket_no].send_starttime ;
		thistime              = &g_ulpgn_socket[socket_no].send_thistime ;
		endtime               = &g_ulpgn_socket[socket_no].send_endtime ;
		timeout_overflow_flag = &g_ulpgn_socket[socket_no].send_timeout_overflow_flag;
	}
	else
	{
		starttime             = &g_ulpgn_socket[socket_no].recv_starttime ;
		thistime              = &g_ulpgn_socket[socket_no].recv_thistime ;
		endtime               = &g_ulpgn_socket[socket_no].recv_endtime ;
		timeout_overflow_flag = &g_ulpgn_socket[socket_no].recv_timeout_overflow_flag;
	}
    *thistime = xTaskGetTickCount();
    if(*timeout_overflow_flag == 0)
    {
        if(*thistime >= *endtime || *thistime < *starttime)
        {
            return -1;
        }
    }
    else
    {
        if(*thistime < *starttime && *thistime <= *endtime)
        {
            /* Not timeout  */
            return -1;
        }
    }
    /* Not timeout  */
    return 0;
}

static int32_t check_timeout(uint8_t serial_ch, int32_t rcvcount)
{
    if(0 == rcvcount)
    {
        thistime[serial_ch] = xTaskGetTickCount();
        if(timeout_overflow_flag[serial_ch] == 0)
        {
            if(thistime[serial_ch] >= endtime[serial_ch] || thistime[serial_ch] < starttime[serial_ch])
            {
                return -1;
            }
        }
        else
        {
            if(thistime[serial_ch] < starttime[serial_ch] && thistime[serial_ch] <= endtime[serial_ch])
            {
                /* Not timeout  */
                return -1;
            }
        }
    }
    /* Not timeout  */
    return 0;
}

static void bytetimeout_init(uint8_t serial_ch, uint32_t timeout_ms)
{
    startbytetime[serial_ch] = xTaskGetTickCount();
    endbytetime[serial_ch] = startbytetime[serial_ch] + timeout_ms;
    if((endbytetime[serial_ch]) < startbytetime[serial_ch])
    {
        /* overflow */
        byte_timeout_overflow_flag[serial_ch] = 1;
    }
    else
    {
        byte_timeout_overflow_flag[serial_ch] = 0;
    }
}

static int32_t check_bytetimeout(uint8_t serial_ch, int32_t rcvcount)
{
    if(0 != rcvcount)
    {
        thisbytetime[serial_ch] = xTaskGetTickCount();
        if(byte_timeout_overflow_flag[serial_ch] == 0)
        {
            if(thisbytetime[serial_ch] >= endbytetime[serial_ch] || thisbytetime[serial_ch] < startbytetime[serial_ch])
            {
                return -1;
            }
        }
        else
        {
            if(thisbytetime[serial_ch] < startbytetime[serial_ch] && thisbytetime[serial_ch] <= endbytetime[serial_ch])
            {
                /* timeout  */
                return -1;
            }
        }
    }
    /* Not timeout  */
    return 0;
}

static int32_t sx_ulpgn_serial_open_for_initial(void)
{
    sci_err_t   my_sci_err;

    R_SCI_PinSet_sx_ulpgn_serial_default();

    memset(&sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], 0, sizeof(sci_hdl_t));
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.baud_rate    = 115200;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.clk_src      = SCI_CLK_INT;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.data_size    = SCI_DATA_8BIT;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.parity_en    = SCI_PARITY_OFF;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.parity_type  = SCI_EVEN_PARITY;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.stop_bits    = SCI_STOPBITS_1;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.int_priority = 14;    // 1=lowest, 15=highest

    my_sci_err = R_SCI_Open(SCI_CH_sx_ulpgn_serial_default, SCI_MODE_ASYNC, &g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT], sx_ulpgn_uart_callback_default_port_for_inititial, &sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT]);

    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

