renesas-rx/rx65n-cloud-kit/lib/third_party/mcu_vendor/renesas/rx_mcu_boards/amazon_freertos_common/network_support/uart_sx_ulpgn/sx_ulpgn_driver.c
    return 0;

}

static int32_t sx_ulpgn_serial_open_for_data(void)
{
    sci_err_t   my_sci_err;
    uint8_t level;

    R_SCI_PinSet_sx_ulpgn_serial_default();

    memset(&sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], 0, sizeof(sci_hdl_t));
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.baud_rate    = 230400;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.clk_src      = SCI_CLK_INT;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.data_size    = SCI_DATA_8BIT;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.parity_en    = SCI_PARITY_OFF;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.parity_type  = SCI_EVEN_PARITY;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.stop_bits    = SCI_STOPBITS_1;
    g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.int_priority = 14;    // 1=lowest, 15=highest

    my_sci_err = R_SCI_Open(SCI_CH_sx_ulpgn_serial_default, SCI_MODE_ASYNC, &g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT], sx_ulpgn_uart_callback_default_port_for_data, &sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT]);

    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

    level = g_sx_ulpgn_sci_config[ULPGN_UART_DEFAULT_PORT].async.int_priority + 1;
    my_sci_err = R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], SCI_CMD_SET_RXI_PRIORITY,&level);
    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }

    return 0;

}


static int32_t sx_ulpgn_serial_second_port_open(void)
{
    sci_err_t   my_sci_err;
//#if ULPGN_USE_UART_NUM == 2
//  if(ULPGN_USE_UART_NUM == 2)
//  {

    R_SCI_PinSet_sx_ulpgn_serial_second();

    memset(&sx_ulpgn_uart_sci_handle[ULPGN_UART_SECOND_PORT], 0, sizeof(sci_hdl_t));
    g_sx_ulpgn_sci_config[ULPGN_UART_SECOND_PORT].async.baud_rate    = 115200;
    g_sx_ulpgn_sci_config[ULPGN_UART_SECOND_PORT].async.clk_src      = SCI_CLK_INT;
    g_sx_ulpgn_sci_config[ULPGN_UART_SECOND_PORT].async.data_size    = SCI_DATA_8BIT;
    g_sx_ulpgn_sci_config[ULPGN_UART_SECOND_PORT].async.parity_en    = SCI_PARITY_OFF;
    g_sx_ulpgn_sci_config[ULPGN_UART_SECOND_PORT].async.parity_type  = SCI_EVEN_PARITY;
    g_sx_ulpgn_sci_config[ULPGN_UART_SECOND_PORT].async.stop_bits    = SCI_STOPBITS_1;
    g_sx_ulpgn_sci_config[ULPGN_UART_SECOND_PORT].async.int_priority = 15;    // 1=lowest, 15=highest

    my_sci_err = R_SCI_Open(SCI_CH_sx_ulpgn_serial_second, SCI_MODE_ASYNC, &g_sx_ulpgn_sci_config[ULPGN_UART_DATA_PORT], sx_ulpgn_uart_callback_second_port_for_command, &sx_ulpgn_uart_sci_handle[ULPGN_UART_SECOND_PORT]);

    if(SCI_SUCCESS != my_sci_err)
    {
        return -1;
    }
//  }
//#endif

    return 0;
}

static int32_t sx_ulpgn_serial_close(void)
{
    sci_err_t   my_sci_err;

    my_sci_err = R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], SCI_CMD_RX_Q_FLUSH, NULL);
    my_sci_err = R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], SCI_CMD_TX_Q_FLUSH, NULL);
    my_sci_err = R_SCI_Close(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT]);
    return 0;
}

static int32_t sx_ulpgn_serial_second_port_close(void)
{
    sci_err_t   my_sci_err;

    my_sci_err = R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_SECOND_PORT], SCI_CMD_RX_Q_FLUSH, NULL);
    my_sci_err = R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_SECOND_PORT], SCI_CMD_TX_Q_FLUSH, NULL);
    my_sci_err = R_SCI_Close(sx_ulpgn_uart_sci_handle[ULPGN_UART_SECOND_PORT]);
    return 0;
}

int32_t sx_ulpgn_socket_init(void)
{
    int i;
    if(ULPGN_USE_UART_NUM == 2)
    {
        for(i = 0; i < g_sx_ulpgn_cleateble_sockets; i++)
        {
            if(BYTEQ_SUCCESS != R_BYTEQ_Open(g_ulpgn_socket[i].socket_recv_buff, sizeof(g_ulpgn_socket[i].socket_recv_buff), &g_ulpgn_socket[i].socket_byteq_hdl))
            {
                return -1;
            }
        }
    }

    /* Success. */
    return 0;

}
static void sx_ulpgn_uart_callback_default_port_for_inititial(void *pArgs)
{
    sci_cb_args_t   *p_args;

    p_args = (sci_cb_args_t *)pArgs;
    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        /* From RXI interrupt; received character data is in p_args->byte */
        R_BSP_NOP();
        R_BSP_NOP();
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
        g_sx_ulpgn_uart_teiflag[ULPGN_UART_DEFAULT_PORT] = 1;
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
           You will need to increase buffer size or reduce baud rate */
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
        R_BSP_NOP();
    }
    else
    {
        /* Do nothing */
    }

} /* End of function my_sci_callback() */



static void sx_ulpgn_uart_callback_second_port_for_command(void *pArgs)
{
    sci_cb_args_t   *p_args;

    p_args = (sci_cb_args_t *)pArgs;
    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        /* From RXI interrupt; received character data is in p_args->byte */
        R_BSP_NOP();
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
        g_sx_ulpgn_uart_teiflag[ULPGN_UART_SECOND_PORT] = 1;
        if(g_sockindex_command_flag == 1)
        {
        	ULPGN_HSUART1_RTS_PODR = 1;
        }
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
           You will need to increase buffer size or reduce baud rate */
    	uart_error_count[ULPGN_UART_SECOND_PORT].queue_overflow_count++;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	uart_error_count[ULPGN_UART_SECOND_PORT].eri_overflow_count++;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	uart_error_count[ULPGN_UART_SECOND_PORT].eri_framing_count++;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	uart_error_count[ULPGN_UART_SECOND_PORT].eri_parity_count++;
    }
    else
    {
        /* Do nothing */
    }

} /* End of function my_sci_callback() */

static void sx_ulpgn_uart_callback_default_port_for_data(void *pArgs)
{
    sci_cb_args_t   *p_args;
    sci_err_t ret;
    byteq_err_t byteq_ret;
    uint8_t data;

    p_args = (sci_cb_args_t *)pArgs;

    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        if((0 == g_temporary_byteq_enable_flag)&&(g_ulpgn_socket[current_socket_index].socket_create_flag == 1))
        {
            /* From RXI interrupt; received character data is in p_args->byte */
            R_SCI_Control(sx_ulpgn_uart_sci_handle[ULPGN_UART_DEFAULT_PORT], SCI_CMD_RX_Q_FLUSH, NULL);
            byteq_ret = R_BYTEQ_Put(g_ulpgn_socket[current_socket_index].socket_byteq_hdl, p_args->byte);
            if (byteq_ret != 0)
            {
                g_ulpgn_socket[current_socket_index].socket_recv_error_count++;
                return;
            }
            else
            {
            }
        }
        else
        {
        	g_ulpgn_socket[current_socket_index].socket_not_create_recv_count= p_args->byte;
        }
    }
#if SCI_CFG_TEI_INCLUDED
    else if (SCI_EVT_TEI == p_args->event)
    {
        g_sx_ulpgn_uart_teiflag[ULPGN_UART_DEFAULT_PORT] = 1;
    }
#endif
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
           You will need to increase buffer size or reduce baud rate */
    	uart_error_count[ULPGN_UART_DEFAULT_PORT].queue_overflow_count++;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        /* From receiver overflow error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	uart_error_count[ULPGN_UART_DEFAULT_PORT].eri_overflow_count++;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        /* From receiver framing error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	uart_error_count[ULPGN_UART_DEFAULT_PORT].eri_framing_count++;
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        /* From receiver parity error interrupt; error data is in p_args->byte
           Error condition is cleared in calling interrupt routine */
    	uart_error_count[ULPGN_UART_DEFAULT_PORT].eri_parity_count++;
    }
    else
    {
        /* Do nothing */
    }

} /* End of function my_sci_callback() */
